import {Component, OnInit, AfterViewInit} from '@angular/core';

let lyric = ["鸳鸯双栖蝶双飞","满园春色惹人醉","悄悄问圣僧","女儿美不美"];
let lyric1 = [{
  "sgc":true,
  "sfy":false,
  "qfy":false,
  "lrc":{
    "version":12,
    "lyric":
      "[00:10.130]马条：我想吻的人不在我身旁\n" +
      "[00:14.500]我想唱的歌不在我心房\n" +
      "[00:19.070]我想种棵树但没有土壤\n" +
      "[00:23.600]我想把骨头包起来献给海洋\n" +
      "[00:27.790]\n" +
      "[00:28.330]艾尔肯：我想走的路不怎么顺畅\n" +
      "[00:32.680]我想读的书都有钢铁的重量\n" +
      "[00:37.230]我想打开的门都已经关上\n[00:41.820]我想冷不丁的划破肃穆的思想\n[00:45.700]\n[00:46.500]合：我想 我想 在夏天穿上冬装\n[00:50.890]我想 我想 听清鸟儿的展望\n[00:55.440]我想 我想 分辨集体的份量\n[01:00.030]突然间 裸露在一个神圣的广场\n[01:04.690]\n[01:23.050]洪启：我想吻的人不在我身旁\n[01:27.350]我想唱的歌不在我心房\n[01:31.820]我想种棵树但没有土壤\n[01:36.380]我想把骨头包起来献给海洋\n[01:40.530]\n[01:40.830]张楚：我想走的路不怎么顺畅\n[01:45.670]我想读的书都有钢铁的重量\n[01:50.000]我想打开的门都已经关上\n[01:54.560]我想冷不丁的划破肃穆的思想\n[01:59.010]\n[01:59.260]合：我想 我想 在夏天穿上冬装\n[02:03.670]我想 我想 听清鸟儿的展望\n[02:08.210]我想 我想 分辨集体的份量\n[02:12.890]突然间 裸露在一个神圣的广场\n[02:17.830]\n[02:36.230]杨嘉松：我想吻的人不在我身旁\n[02:40.900]我想唱的歌不在我心房\n[02:45.340]我想种棵树但没有土壤\n[02:49.850]我想把骨头包起献给海洋\n[02:54.190]\n[02:54.440]钟立风：我想走的路不怎么顺畅\n[02:59.000]我想读的书都有钢铁的重量\n[03:03.540]我想打开的门都已经关上\n[03:08.110]我想冷不丁的划破肃穆的思想\n[03:12.240]\n[03:12.440]合：我想 我想 在夏天穿上冬装\n[03:17.250]我想 我想 听清鸟儿的展望\n[03:21.740]我想 我想 分辨集体的份量\n[03:26.430]突然间 裸露在一个神圣的广场\n[03:31.440]合：我想 我想 在夏天穿上冬装\n[03:35.680]我想 我想 听清鸟儿的展望\n" +
      "[03:40.140]我想 我想 分辨集体的份量\n" +
      "[03:44.690]突然间 裸露在一个神圣的广场\n"},
  "klyric":{"version":0},"tlyric":{"version":0,"lyric":null},"code":200}];

let lyric2  = "[00:10.130]马条：我想吻的人不在我身旁\n[00:14.500]我想唱的歌不在我心房\n" +
"[00:19.070]我想种棵树但没有土壤\n" +
"[00:23.600]我想把骨头包起来献给海洋\n" +
"[00:27.790]\n" +
"[00:28.330]艾尔肯：我想走的路不怎么顺畅\n" +
"[00:32.680]我想读的书都有钢铁的重量\n" +
"[00:37.230]我想打开的门都已经关上\n[00:41.820]我想冷不丁的划破肃穆的思想\n[00:45.700]\n[00:46.500]合：我想 我想 在夏天穿上冬装\n[00:50.890]我想 我想 听清鸟儿的展望\n[00:55.440]我想 我想 分辨集体的份量\n[01:00.030]突然间 裸露在一个神圣的广场\n[01:04.690]\n[01:23.050]洪启：我想吻的人不在我身旁\n[01:27.350]我想唱的歌不在我心房\n[01:31.820]我想种棵树但没有土壤\n[01:36.380]我想把骨头包起来献给海洋\n[01:40.530]\n[01:40.830]张楚：我想走的路不怎么顺畅\n[01:45.670]我想读的书都有钢铁的重量\n[01:50.000]我想打开的门都已经关上\n[01:54.560]我想冷不丁的划破肃穆的思想\n[01:59.010]\n[01:59.260]合：我想 我想 在夏天穿上冬装\n[02:03.670]我想 我想 听清鸟儿的展望\n[02:08.210]我想 我想 分辨集体的份量\n[02:12.890]突然间 裸露在一个神圣的广场\n[02:17.830]\n[02:36.230]杨嘉松：我想吻的人不在我身旁\n[02:40.900]我想唱的歌不在我心房\n[02:45.340]我想种棵树但没有土壤\n[02:49.850]我想把骨头包起献给海洋\n[02:54.190]\n[02:54.440]钟立风：我想走的路不怎么顺畅\n[02:59.000]我想读的书都有钢铁的重量\n[03:03.540]我想打开的门都已经关上\n[03:08.110]我想冷不丁的划破肃穆的思想\n[03:12.240]\n[03:12.440]合：我想 我想 在夏天穿上冬装\n[03:17.250]我想 我想 听清鸟儿的展望\n[03:21.740]我想 我想 分辨集体的份量\n[03:26.430]突然间 裸露在一个神圣的广场\n[03:31.440]合：我想 我想 在夏天穿上冬装\n[03:35.680]我想 我想 听清鸟儿的展望\n" +
"[03:40.140]我想 我想 分辨集体的份量\n" +
"[03:44.690]突然间 裸露在一个神圣的广场\n";

let lyric3 = lyric2.split("\n");



@Component({
  selector: 'bp-audio-recommend',
  templateUrl: './audio-recommend.component.html',
  styleUrls: ['./audio-recommend.component.css']
})
export class AudioRecommendComponent implements OnInit, AfterViewInit {

  constructor() { }

  ngOnInit() {
   var tt = this.parseLyric(lyric2);

    console.log(tt);
  }



 parseLyric(lrc) {
   var lyrics = lrc.split("\n");

   var lrcObj = {};
   for (var i = 0; i < lyrics.length; i++) {
     var lyric = decodeURIComponent(lyrics[i]);
     var timeReg = /\[\d*:\d*((\.|\:)\d*)*\]/g;
     var timeRegExpArr = lyric.match(timeReg);
     if (!timeRegExpArr)continue;
     var clause = lyric.replace(timeReg, '');

     for (var k = 0, h = timeRegExpArr.length; k < h; k++) {
       var t = timeRegExpArr[k];
       var min = Number(String(t.match(/\[\d*/i)).slice(1)),
         sec = Number(String(t.match(/\:\d*/i)).slice(1));
       var time = min * 60 + sec;
       lrcObj[time] = clause;
     }
   }
   return lrcObj;

 }

  private testV = false;

  test(){
    this.test != this.test;
  }

  pos = 0;
  get line() {
    return lyric3[this.pos];
  }
  ngAfterViewInit() {
    setInterval(()=> this.pos = (this.pos+1)%4, 1500);

  }
}




